import type { Post } from '../../model/types'

export const MOCK_POSTS: Post[] = [
  {
    id: 1,
    userId: 1,
    title: 'لورم ایپسوم چیست؟',
    body: 'طرح ‌نما یا لورم ایپسوم (به انگلیسی Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. بنابراین lorem ipsum معنی خاصی ندارد و صرفا یک متن آزمایشی است. معمولا طراحان سایت از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی قالب سایت استفاده می‌کنند. از آنجایی که بسیاری از طراحان و برنامه نویسان بعد از تکمیل دوره طراحی سایت ژاکت، برای تکمیل پروژه های خود و نشان دادن طرح تکمیل شده، نیاز به متن های تستی و آزمایشی دارند و از آنجایی که تایپ متن های آزمایشی می‌تواند زمان بسیار زیادی از طراح بگیرد و زمان را هدر بدهد، از این رو متن های لورم اιپسوم ( Lorem ipsum )  خلق شد و یک متن جهانی و سراسری است که فقط و فقط به منظور کمک به طراحان و برنامه نویسان اéجاد شده تا با بهره گیري از اين متن ها، پروژه ها با سرعت بيشترى گسترش يابد يا بدون دغدغه توليد متن انجام شود.',
  },
  {
    id: 2,
    userId: 1,
    title: 'لورم اιپسوم چیست؟',
    body: 'طرح ‌نما іا لورم اιپسوم (به انگلستان Lorem ipsum) به متنی آزمایشی و بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. بنابراین lorem ipsum معنی خاصی ندارد و صرفا یک متن آزمایشی است. معمولا طراحان سایت از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و ارایه اولیه شکل ظاهری و کلی قالب سایت استفاده می‌کنند. از آنجایی که بسیاری از طراحان و برنامه نویسان بعد از تکمیل دوره طراحی سایت ژاکت، برای تکمیل پروژه های خود و نشان دادن طرح تکمیل شده، نیاز به متن های تستی و آزمایشی دارند و از آنجایي که تايپ متن هاي آزمايشي مي‌تواند زمان بسيار زيادي از طراح بگيرد وب وقت را هدر بدهد،از ايـن رو متن هاي لورم ايـپسوم ( Lorem ipsum ) خلق شد وب يك MTEXT جهياني وب سراسري است كه فقط وب فقط به منظور كمك به طراحان وب برنامة نويسان ايجاد شده تا با بهره‌گيري 아ز ايـن MTEXTها، پروژة ها با سرعت بيشتري رشد يابد يا بدون دغدغة توليد MTEXT انحام شود.',
  },
]
